Revit 2027 API
BuiltInFailures.WallJoinRoofFailures.WallNotCoveredByRoof Property
 The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallNotCoveredByRoof { get; }
Public Shared ReadOnly Property WallNotCoveredByRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallNotCoveredByRoof {
	FailureDefinitionId^ get ();
}
static member WallNotCoveredByRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace